app/Models/DataUser.php

SELECT *
FROM `tbl_user`
---
   public function getAllData()
   {
    return $this->db->table('tbl_user')
      ->get()->getResultArray();