app/Models/ModelAuth.php

SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = 'admin'
---
    public function login($email,$password)
    {
        return $this->db->table('tbl_user')->where([
            'email'=>$email,
            'password'=>$password,
        ])->get()->getRowArray();