app/Models/TabelLog.php

   public function getAllData()
   {
    return $this->db->table('tbl_log')
      ->get()->getResultArray();
---
SELECT *
FROM `tbl_log`